Merge pull request #24 from HNGM-HP/beta
Beta
